/*

Задача 1. Автор программы

Описание:
Нужно написать программу для вывода имени ее разработчика в консоль.

Функционал программы:
Вывод сообщения в консоли "Имя разработчика".

* */


package netology.part02;

public class Task01 {
    public static void main(String[] args) {
        System.out.println("Панин Николай");
    }
}
